# ContextMenu Properties

---
The ContextMenu type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
ContextMenu Class
Autodesk.Revit.UI Namespace